Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་གཟི་བརྗིད་རྣམ་གྲགས་ཚོང་དཔོན་གྱི། །བུ་ཚེ་བདེ་གཤེགས་མཐུ་རྩལ་སྟོབས་དེ་ལ། །མེ་ཏོག་དག་གི་ཕུར་མ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vighuṣṭatejas, when the son of a merchant, Offered floral powders To the well-gone Powerful Strength And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འགྲོ་བའི་དབང་ཕྱུག་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་པད་འདབ་སྤྱན་དེ་ལ། །ནོར་བུའི་སྒྲོན་མ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jagadīśvara, when a captain, Offered a jewel lamp To the thus-gone Lotus Petal Eyes And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ལྗོན་པ་དབུལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་འོད་དེ་ལ། །མ་ཥའི་སྒྲོན་མ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Druma, when a poor person, Offered a maṣa lamp To the thus-gone Light of Awakening And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཏི་མུག་རབ་ཟད་བྱ་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྒྲ་དབྱངས་མཆོག་དེ་ལ། །ཤ་སྲང་གཅིག་ཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Supraṇaṣṭamoha, when a spy, Offered a measure of meat To the thus-gone Supreme Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དཔག་མེད་ལྷ་རིས་པ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མངོན་ཤེས་དྲུག་སྒྲ་ལ། །ཚེམས་ཤིང་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amita, when a god, Offered toothsticks To the thus-gone Sound of the Six Superknowledges And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཟླ་བ་བཟང་པོ་དགེ་སློང་ཚེ། །དེ་བཞིན་གཤེགས་པ་མདངས་སྟོབས་དེ་ལ་ནི། །གདིང་བ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sucandra, when a monk, Offered sitting mats To the thus-gone Strength of Brightness And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྤོབས་པ་མཐའ་ཡས་ཏོག །ཚོང་དཔོན་བུ་ཚེ་བདེ་གཤེགས་མི་ཡི་གྲངས། །མར་མེའི་ཕྲེང་བ་དངར་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Ananta­pratibhāna­ketu, when the son of a merchant, Offered an arrangement of garlands of lamps To the well-gone Human Category And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བརྟུལ་ཞུགས་བསྟར་བ་ཚོང་པའི་ཚེ། །བདེ་གཤེགས་རྒྱལ་བའི་མེ་ཏོག་ཚོགས་དེ་ཡི། །སྐུ་ལ་ཙན་དན་དམར་པོས་བྱུགས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vratanidhi, when a merchant, Offered red sandalwood body ointment To the well-gone Gathering of the Flowers of the Victors And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཆོད་གནས་ལྷ་ཡི་རིམ་གྲོ་པ། །བྱེད་ཚེ་དེ་བཞིན་གཤེགས་པ་གཙུག་ཆེན་ལ། །མེ་ཏོག་རྙིས་པ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pūjya, when a priest of the gods, Offered dried flowers To the thus-gone Great Crown And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མྱ་ངན་རྒལ་བ་སྨྱིག་མ་མཁན། །བྱེད་ཚེ་བདེ་གཤེགས་ལྷ་ཡི་བདག་པོ་ལ། །ཏ་ལ་མུ་ཏིག་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Uttīrṇaśoka, when a bamboo craftsman, Offered tala pearls To the well-gone Divine Ruler And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དགེ་དགྱེས་འབྲུ་མར་མཁན་གྱི་ཚེ། །བདེ་གཤེགས་བག་མི་ཚ་བར་གནས་པ་ལ། །འབྲུ་མར་སྲང་གཅིག་ཅིག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kṣemapriya, when a producer of grain oil, Offered a measure of grain oil To the well-gone Remaining Undaunted And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འགྲོ་བའི་བླ་གྲོས་འབྲུ་མར་མཁན། །བྱེད་ཚེ་བདེ་གཤེགས་དགྲ་བཅོམ་བྱང་ཆུབ་ལ། །ཡུངས་མར་སྲང་བརྒྱད་སྙེད་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jagadmati, when a producer of grain oil, Obtained eight measures of mustard seed oil and offered it To the well-gone Awakening of the Worthy And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དགྱེས་གཤེགས་རྒྱལ་བུའི་ཚེ། །བདེ་གཤེགས་མྱ་ངན་མུན་པ་སེལ་བ་ལ། །རྨ་བྱ་དག་ལས་བྱས་པའི་བསིལ་ཡབ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Priyaṅgama, when a prince, Offered a fan made of peacock feathers To the well-gone Dispeller of the Darkness of Suffering And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཞབས་མཛེས་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཆུ་བོ་རྣམ་དག་ལ། །མུ་ཏིག་དག་གིས་གཏོར་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Caraṇābhijñāta, when a captain, Scattered pearls Before the thus-gone River of Purity And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཨུད་པལ་བརྒྱ་བྱིན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་འོད་དེ་ལ། །སྐུ་ཚེའི་འདུ་བྱེད་གཟུང་བར་གསོལ་བཏབ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Utpala, when Śakra, Requested the thus-gone Moonlight To maintain the formative factors of his lifespan, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དུལ་གནས་མེ་ཏོག་གསེར་རྟོག་ཚེ། །དེ་བཞིན་གཤེགས་པ་དཔའ་བའི་སེམས་དེ་ལ། །གསེར་དག་གིས་ནི་གཏོར་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṣpa­dama­sthita, when an expert on gold, Scattered gold Before the thus-gone Heroic Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤོབས་པ་མཐའ་ཡས་འོད་ཟེར་པད་མ་མཁན། །བྱེད་ཚེ་དེ་བཞིན་གཤེགས་པ་ཐར་པའི་ཤེས་རབ་ལ། །ཤིང་ལས་བྱས་པའི་ལྷུང་བཟེད་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ananta­pratibhāna­raśmi, when an expert on lotus flowers, Offered an alms bowl made of wood To the thus-gone Insight of Liberation And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དྲང་སྲོང་གསལ་བ་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་དཔའ་བོའི་སེམས་དེ་ལ། །མེ་ཏོག་དག་ལས་བྱས་པའི་གདུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ṛṣiprasanna, when a garland maker, Offered a parasol made of flowers To the thus-gone Heroic Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་བརྩོན་འགྲུས་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཙམ་པའི་སྒྲོན་མ་ལ། །འཇམས་གང་ཞིག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇavīrya, when a householder, Offered some rice gruel To the thus-gone Campaka Lamp And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྙིང་པོ་མར་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཆོད་གནས་དཔལ་དེ་ལ། །ཞུན་མར་སྲང་བརྒྱད་སྙེད་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sāra, when a butter merchant, Offered eight measures of clarified butter To the thus-gone Glorious Object of Worship And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་བདག་ཀ་རན་ཛ་བྱེད་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་ལེགས་སེམས་ལ། །བཀྴ་ཀ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Marudadhipa, when a worker in karañja wood, Offered a meal To the thus-gone Excellent Mind of Intelligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་མཐོན་པོ་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་དཔལ་དེ་ལ། །སྤོས་དང་ཕྲེང་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Uccaratna, when a prince, Offered incense and garlands To the thus-gone Splendid Glory And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གསལ་བ་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྐྱེ་བོ་དད་པ་ལ། །སྦྲང་རྩི་བལྡག་པར་བྱ་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Prasanna, when a merchant, Offered honey to lick To the thus-gone Faith of the People And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྐལ་ལྡན་ཤིང་རྟ་ཅན། །ལྷམ་མཁན་ཚེ་ན་བདེ་གཤེགས་བློ་མཆོག་ལ། །མཆིལ་ལྷམ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Bhāgīratha, when a shoemaker, Offered footwear To the well-gone Supreme Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསོད་ནམས་བློ་གྲོས་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་རབ་དགྱེས་གསལ་བ་ལ། །མེ་ཏོག་དག་གི་ཆུན་པོ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṇyamati, when a garland maker, Offered a bouquet of flowers To the thus-gone Clear Delight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྦྱིན་སྲེག་འོད་འཕྲོ་ཐགས་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདག་ཉིད་སྣང་བ་ལ། །རས་ཀྱི་ཁ་ཚར་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Hutārci, when a weaver, Offered cotton tassels To the thus-gone Illuminating Identity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་མཐའ་ཡས་གཟི་བརྗིད་ཕུང་པོ་ནི། །ཚོང་པ་བྱེད་ཚེ་བདེ་གཤེགས་མི་ཡི་པད་མ་ལ། །རས་ཡུག་ཟུང་དུ་སྦྱར་ཏེ་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ananta­guṇa­tejorāśi, when a merchant, Joined two measures of cotton and offered them To the thus-gone Lotus of Humanity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་སྟབས་ནི་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤོས་དྲི་ཞིམ་པ་ལ། །སེའུ་འབྲུའི་བཅུད་ཁུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhavikrāmin, when a forest guard, Offered pomegranate juice To the thus-gone Fragrant Incense And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མི་གཡོ་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཆོད་པ་མཆོག་དེ་ལ། །ཨ་ཏི་མུག་ཏའི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Acala, when a forest guard, Scattered atimukta flowers Before the thus-gone Supreme Worship And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རབ་གསལ་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་ལ། །མར་ཁུར་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Prasanna, when a physician, Offered clarified butter To the thus-gone Diverse Flowers And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་སྤྱོད་ཁྱིམ་བདག་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་འཕགས་པའི་དཔལ་དེ་ལ། །ཕྲེང་བ་བརྒྱུས་པ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Cīrṇaprabha, when the son of a householder, Offered strings of garlands To the thus-gone Glory of the Noble Ones And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གླུ་དབྱངས་ཤིང་རྟ་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ནམ་མཁའ་མཚུངས་དེ་ལ། །གཟིམས་ཁྲི་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Nāgaruta, when a chariot maker, Offered a bed To the thus-gone Equal to the Sky And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གླུ་དབྱངས་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་པད་མའི་འོད་ཟེར་ལ། །མེ་ཏོག་སིལ་མ་དག་ནི་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Saṃgīti, when a physician, Scattered flower petals Before the thus-gone Radiant Lotus And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཁོར་ལོ་འཛིན་པ་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསལ་བའི་ལྷ་དེ་ལ། །མེ་ཏོག་སིལ་མ་དག་གིས་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Cakradhara, when a garland maker, Scattered flower petals Before the thus-gone God of ClarityAnd in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དབྱིག་མཆོག་རལ་པ་ཅན་གྱི་ཚེ། །བདེ་གཤེགས་བསམ་གྱིས་མི་ཁྱབ་སྟེགས་དེ་ལ། །རྩྭ་ཡི་མལ་སྟན་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vasuśreṣṭha, when a dreadlocked ascetic, Offered a straw mattress To the well-gone Inconceivable Support And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཇིག་རྟེན་དགའ་བ་ཚོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་འོད་དེ་ལ། །ཕྲེང་བ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Lokapriya, when a merchant, Offered garlands To the thus-gone Moonlight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་ཀྱི་ཟླ་བ་ལག་བླའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཕུང་པོ་ཆེན་པོ་ལ། །ཤིང་མཆོག་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dharmacandra, when a supervisor of a new building, Offered supreme trees To the thus-gone Great Gathering And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཐའ་ཡས་གྲགས་པ་ཕྱུགས་རྫི་ཡི། །དཔོན་པོའི་ཚེ་ན་བདེ་གཤེགས་སྟོབས་ཆེན་ལ། །འོ་མ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ananta­rati­kīrti, when a leader of cattle herders, Offered milk To the well-gone Great Strength And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྤྲིན་ཏོག་གོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡུལ་འཁོར་ཡེ་ཤེས་ལ། །རས་ཡུག་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Meghadhvaja, when a garment merchant, Offered a cotton fabric To the thus-gone Wisdom of the Land And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤེས་རབ་འགྲོས་ནི་ཁྱིམ་བདག་ཚེ། །འཁོར་གྱི་ཁྱམས་དག་ཕྱག་དར་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་དྲག་ཤུལ་བློ་གྲོས་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prajñāgati, when a householder, Swept the courtyard Before the thus-gone Fierce Intelligence And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྤོས་བཟངས་དབུལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རི་དབང་བློ་དེ་ལ། །མར་མེའི་སྙིང་པོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sugandha, when a poor man, Offered lamp wicks To the thus-gone Mind of the King of Mountains And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ནམ་མཁའི་དབྱངས་ནི་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡན་ལག་མཛེས་པ་ལ། །ན་བཟའ་ཕྲུགས་གཅིག་ཅིག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gaganasvara, when a merchant, Offered a set of robes To the thus-gone Beautiful Limbs And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་ནི་ལྷ་རིས་པ་ཡི་ཚེ། །ཕྱག་དར་དག་ནི་བྱ་བ་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་དཔལ་གྱི་མཆོག་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Deva, when a god, Served as sweeper Before the thus-gone Supreme Glory, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་རྒྱལ་ཕྱུགས་རྫིའི་དཔོན་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དཔལ་གྱི་བཤེས་གཉེན་ལ། །འོ་མ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Devarāja, when a leader of cattle herders, Offered milk To the thus-gone Glorious Friend And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ནོར་བུ་གསལ་ནི་དཀའ་ཐུབ་ཅན། །བྱེད་ཚེ་བདེ་གཤེགས་ཡིད་གཉིས་སྤོང་བ་པོ། །དེ་ལ་གདུགས་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Maṇiviśuddha, when undertaking austerities, Offered parasols To the well-gone Abandoning Doubt And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ནོར་བཟངས་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་ལྡན་དེ་ལ། །ཀཱར་ཥཱ་པ་ནི་གཅིག་རིའི་འབྲུ་མར་དང་། །སྤོས་ཕུལ་དང་པོར་བྱང་ཆུབ་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sudhana, when an incense merchant, Offered grain oil worth one karṣapaṇa To the thus-gone Defeating the Enemy And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྒྲོན་མ་གཽ་ཏམ་ཚེ། །དབྱར་གནས་པ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་དཔལ་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Pradīpa, when he belonged to the Gautama clan, Offered accommodation for the rains retreat To the thus-gone Incense Glory And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ང་རོ་དབྱངས། །ཚོང་འདུས་པ་ཚེ་བདེ་གཤེགས་དགྲ་བཅོམ་གནས། །དེ་ལ་ཞུན་མར་བྲེ་གང་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Ratna­svara­ghoṣa, when a market merchant, Offered a measure of clarified butter To the well-gone Abode of the Worthy And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐྱེ་དབང་རྒྱལ་པོ་ཚོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་གནས་དེ་ལ། །ཀུན་དགའ་ར་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Janendrarāja, when a merchant, Offered a pleasure grove To the thus-gone Abode of Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྒྲ་གཅན་སྦེད་པ་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་ཆེར་དགོངས་ལ། །སྒེའུ་གཤེར་དག་གི་དུམ་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Rāhugupta, when a forest guard, Offered a piece of fresh brown ginger To the thus-gone Intent on Great Diligence And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དགེ་མཛད་ཆུ་ཆུན་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་ནི་འབར་བ་ལ། །ཆུ་གྲང་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Kṣemaṃkara, when a water carrier, Offered cool water To the thus-gone Blazing Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་བློ་གྲོས་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐུ་རྩལ་སྡུད་པ་ལ། །མེ་ཏོག་བལྟ་ན་སྡུག་པ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhamati, when a householder, Offered delightful flowers To the thus-gone Gathering Power And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་གྲགས་པ་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགོངས་པ་ཟབ་བསྒོམས་ལ། །སྒྲ་དབྱངས་དག་གི་མཆོད་པ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnayaśas, when a forest guard, Offered melodious songs To the thus-gone Cultivating Profound Realization And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དོན་མཛད་ཕྱུག་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤོས་སྲེག་དེ་ལ་ནི། །རྔ་བོ་ཆེ་དག་བརྡུང་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Kṛtārtha, when a rich man, Beat great drums Before the thus-gone Burning Incense And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཛད་མཐའ་གཟིགས་པ་ཁྱིམ་བདག་ཚེ། །གཙུག་ལག་ཁང་དག་བྱས་ཏེ་ཕུལ་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་གླང་པོ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kṛtāntadarśin, when a householder, Offered a monastic temple To the thus-gone Fragrance Elephant And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྲིད་པའི་མེ་ཏོག་ཁྲུས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྣམ་པར་འབྱེད་བློ་ལ། །ཁྲུས་རས་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Bhavapuṣpa, when a washerman, Offered bathing towels To the thus-gone Discerning Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཛོད་སྤུ་ལྡན་པ་དྲང་སྲོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་མཆོག་དེ་ལ། །ཀུ་ཤ་དག་ལས་བྱས་པའི་ན་བཟའ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ūrṇa, when a sage, Offered robes made of kuśa grass To the thus-gone Supreme Intelligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤོབས་པ་མཚུངས་མེད་རྒྱལ་པོ་རི་མོ་མཁན། །བྱེད་ཚེ་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་བཀོད་པ་པོ། །དེ་ལ་མེ་ཏོག་དག་གི་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Atula­pratibhāna­rāja, when a painter, Offered a flower garland To the thus-gone Building the Array of Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་རྣམ་འབྱེད་ང་རོ་འགྲོན་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བརྟུལ་ཞུགས་སེང་གེ་དེ་ཡི་ནི། །ལམ་སྲང་དག་ཏུ་གོས་ནི་གདིང་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vibhakta­jñā­svara, when a visitor, Covered the road with garments Before the thus-gone Lion of Yogic Discipline And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་མཆེ་བ་དགེ་སློང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་བློ་གྲོས་ལ། །ལྷུང་བཟེད་ཆུང་ངུ་སྐྱུ་རུ་རས་བཀང་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhadaṃṣṭra, when a monk, Filled a small alms bowl with myrobalan and offered it Before the thus-gone Wisdom Intelligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཛེས་པར་གཤེགས་པ་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ལྷུན་པོ་ལ། །སེང་གེའི་གདན་ཁྲི་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Laḍitagāmin, when a captain, Offered a lion throne To the thus-gone Majestic Mountain of Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསོད་ནམས་འཁོར་ལོས་སྒྱུར་རྒྱལ་ཚེ། །དེ་བཞིན་གཤེགས་པ་ང་རོ་སྦྱངས་པ་ལ། །རིན་པོ་ཆེ་ལས་བྱས་པའི་བླ་རེ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṇya, when a universal monarch, Offered a jewel canopy To the thus-gone Purified Roar And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་སྒྲོན་གདུགས་ནི་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསྡུ་བ་རྣམ་འབྱེད་ལ། །ལྷུང་བཟེད་རིན་པོ་ཆེ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dharmapradīpacchatra, when a merchant, Offered an alms bowl with jewels To the thus-gone Discerning Collocations And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བཀྲ་ཤིས་ལྡན་པ་ཚོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསལ་བའི་དཔལ་དེ་ལ། །ཀུན་དགའ་ར་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Maṅgalin, when a merchant, Offered pleasure groves To the thus-gone Glory of Clarity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡུལ་འཁོར་མྱ་ངན་མེད་པ་པོ། །ཚོང་དཔོན་བུ་ཚེ་སྟན་རིངས་ཕུལ་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་ཟླ་བ་སྣང་བ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Aśokarāṣṭra, when the son of a merchant, Readily offered a seat To the thus-gone MoonlightAnd in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བློ་གྲོས་སེམས་དཔའ་ཁྱིམ་བདག་ཚེ། །གནས་དང་ཟས་ཀྱི་རྐྱེན་རིས་བཅད་ནས་ཀྱང་། །བདེ་གཤེགས་ཡོན་ཏན་ཕུང་པོ་འོད་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Maticintin, when a householder, Apportioned the cost of residence and food Before the well-gone Light of a Mass of Qualities And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བློ་ལྡན་འུག་པའི་ཚེ། །གོས་དང་ཤིང་ལེབ་དག་ནི་བཞག་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྟོབས་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Matimat, when an owl, Placed clothing and a wooden board Before the thus-gone Strength of Dharma And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་སྒྲོན་སྤྱན་ནི་དབུལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་ལྡན་དེ་ལ། །རྒྱ་སྲན་དྲུས་པ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dharma­pradīpākṣa, when a poor man, Offered beans and millet To the thus-gone Endowed with Intelligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤུགས་འདོར་བུ་རམ་ཆང་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྣམ་གྲགས་རྒྱལ་པོ་ལ། །བུ་རམ་ཤིང་གི་བཅུད་ཁུ་བཏུང་བ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vegajaha, when a distiller of rum, Offered sugarcane juice To the thus-gone King of Fame And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྟོབས་ཆེན་ཚོང་པའི་ཆུང་མའི་ཚེ། །ཕྱེ་ཁལ་གསུམ་ནི་གཉུག་མར་བཞག་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་དབང་པོ་ཐུལ་བ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Atibala, when the wife of a merchant, Offered three bushels of flour for residents To the thus-gone Senses Tamed And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤེས་རབ་མེ་ཏོག་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྟབས་ཀྱི་མཆོག་མ་དེའི། །ལམ་སྲང་དག་ནི་ཕྱག་དར་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prajñāpuṣpa, when a captain, Swept the road clean Before the thus-gone Supreme Stride And in doing so first gave rise to the mind of awakening.
